[
  {
    "_id": "JjqaXNcpN",
    "title": "Baseball in April and Other Stories",
    "author": "Gary Soto",
    "isbn": "015205720X",
    "summary": "The Mexican American author Gary Soto draws on his own experience of growing up in California’s Central Valley in this finely crafted collection of eleven short stories that reveal big themes in the small events of daily life. Crooked teeth, ponytailed girls, embarrassing grandfathers, imposter Barbies, annoying brothers, Little League tryouts, and karate lessons weave the colorful fabric of Soto’s world. The smart, tough, vulnerable kids in these stories are Latino, but their dreams and desires belong to all of us. Glossary of Spanish terms included.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/baseball_in_april.jpg",
    "lexile_measure": 830,
    "amazon_popularity": 3.65,
    "num_pages": 111,
    "genres": []
  },
  {
    "_id": "NECojxy4P",
    "title": "Hatchet",
    "author": "Gary Paulsen",
    "isbn": "27701301",
    "summary": "Brian is on his way to Canada to visit his estranged father when the pilot of his small prop plane suffers a heart attack. Brian is forced to crash-land the plane in a lake--and finds himself stranded in the remote Canadian wilderness with only his clothing and the hatchet his mother gave him as a present before his departure. \nBrian had been distraught over his parents' impending divorce and the secret he carries about his mother, but now he is truly desolate and alone. Exhausted, terrified, and hungry, Brian struggles to find food and make a shelter for himself. He has no special knowledge of the woods, and he must find a new kind of awareness and patience as he meets each day's challenges. Is the water safe to drink? Are the berries he finds poisonous?\nSlowly, Brian learns to turn adversity to his advantage--an invading porcupine unexpectedly shows him how to make fire, a devastating tornado shows him how to retrieve supplies from the submerged airplane. Most of all, Brian leaves behind the self-pity he has felt about his predicament as he summons the courage to stay alive.\nA story of survival and of transformation, this riveting book has sparked many a reader's interest in venturing into the wild.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/hatchet.jpg",
    "lexile_measure": 1020,
    "amazon_popularity": 3.69,
    "num_pages": 192,
    "genres": []
  },
  {
    "_id": "fRGJN4d1p",
    "title": "Peak",
    "author": "Roland Smith",
    "isbn": "152024174",
    "summary": "After fourteen-year-old Peak Marcello is arrested for scaling a New York City skyscraper, he's left with two choices: wither away in Juvenile Detention or go live with his long-lost father, who runs a climbing company in Thailand. But Peak quickly learns that his father's renewed interest in him has strings attached. Big strings. As owner of Peak Expeditions, he wants his son to be the youngest person to reach the Everest summit--and his motives are selfish at best. Even so, for a climbing addict like Peak, tackling Everest is the challenge of a lifetime. But it's also one that could cost him his life.\nRoland Smith has created an action-packed adventure about friendship, sacrifice, family, and the drive to take on Everest, despite the incredible risk. The story of Peak’s dangerous ascent—told in his own words—is suspenseful, immediate, and impossible to put down.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/peak.jpg",
    "lexile_measure": 760,
    "amazon_popularity": 3.98,
    "num_pages": 246,
    "genres": []
  },
  {
    "_id": "eRJATyRj2",
    "title": "The Phantom Tollbooth",
    "author": "Norton Juster",
    "isbn": "394821998",
    "summary": "Illustrated in black-and-white. This ingenious fantasy centers around Milo, a bored ten-year-old who comes home to find a large toy tollbooth sitting in his room. Joining forces with a watchdog named Tock, Milo drives through the tollbooth's gates and begins a memorable journey. He meets such characters as the foolish, yet lovable Humbug, the Mathemagician, and the not-so-wicked \"Which,\" Faintly Macabre, who gives Milo the \"impossible\" mission of returning two princesses to the Kingdom of Wisdom.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/phantom_tollbooth.jpg",
    "lexile_measure": 1000,
    "amazon_popularity": 4.21,
    "num_pages": 255,
    "genres": []
  },
  {
    "_id": "2M-V5YT_o",
    "title": "Island of the Blue Dolphins",
    "author": "Scott O'Dell",
    "isbn": "318572540",
    "summary": "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.\nThis is the story of Karana, the Indian girl who lived alone for years on the Island of the Blue Dolphins. Year after year, she watched one season pass into another and waited for a ship to take her away. But while she waited, she kept herself alive by building shelter, making weapons, finding food, and fighting her enemies, the wild dogs. It is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/island_blue_dolphins.jpg",
    "lexile_measure": 1000,
    "amazon_popularity": 3.81,
    "num_pages": 192,
    "genres": []
  },
  {
    "_id": "Afew9koZO",
    "title": "The Lightning Thief",
    "author": "Rick Riordan",
    "isbn": "9781417732470",
    "summary": "Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods.",
    "cover_photo_url": "https://storage.googleapis.com/reading-rewards-books/lightning_thief.jpg",
    "lexile_measure": 740,
    "amazon_popularity": 4.24,
    "num_pages": 377,
    "genres": []
  }
]